import 'package:dio/dio.dart';
import 'package:flutter/foundation.dart';

/// This interceptor is used to show request and response logs
class LoggerInterceptor extends Interceptor {
  @override
  void onError(DioException err, ErrorInterceptorHandler handler) async {
    if (kDebugMode) {
      debugPrint(
        '📕\n'
        '\x1B[31m┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────'
        '\n│🐛 Error type: ${err.error}'
        '\n│🐛 Error message: ${err.message}'
        '\n└───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────\x1B[0m',
      );
    }
    handler.next(err);
  }

  @override
  Future<void> onRequest(
    RequestOptions options,
    RequestInterceptorHandler handler,
  ) async {
    if (kDebugMode) {
      debugPrint(
        '📘\n'
        '\x1B[34m┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────'
        '\n│🐛 ${options.method} ${options.path}'
        '\n│🐛 Headers: ${options.headers}'
        '\n│🐛 Query Parameters: ${options.queryParameters}'
        '\n│🐛 Body: ${options.data}'
        '\n└───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────\x1B[0m',
      );
    }
    handler.next(options);
  }

  @override
  void onResponse(Response response, ResponseInterceptorHandler handler) async {
    if (kDebugMode) {
      debugPrint(
        '📗\n'
        '\x1B[32m┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────'
        '\n│🐛STATUS CODE: ${response.statusCode}'
        '\n│🐛STATUS MESSAGE: ${response.statusMessage}'
        '\n│🐛Data: ${response.data}'
        '\n└───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────\x1B[0m',
      );
    }
    handler.next(response);
  }
}
