Repository: DineshBalayan/FaceAuthSdkByAadhaarRd
Catalog: assets/l10n/app_*.arb
Languages: hi

# aadhaarConsentHi
source: मैं (माता-पिता/कानूनी अभिभावक, यदि नाबालिग हो) स्वेच्छा से अपनी सहमति प्रदान करता/करती हूँ कि मेरे आधार संख्या का उपयोग DoIT&C फेस ऑथेंटिकेशन मोबाइल ऐप पर लॉगिन/पंजीकरण हेतु, भारतीय विशिष्ट पहचान प्राधिकरण (UIDAI) के माध्यम से आधार आधारित चेहरे के प्रमाणीकरण के लिए किया जाए। प्रमाणीकरण की प्रक्रिया में प्राप्त "हाँ/ना" उत्तर के आधार पर, मैं स्वयं को DoIT&C फेस ऑथेंटिकेशन मोबाइल ऐप पर पंजीकृत करने हेतु सहमति प्रदान करता/करती हूँ, जिससे ऐप की सेवाओं का उपयोग किया जा सके। मैं आधार आधारित चेहरे के प्रमाणीकरण का चयन स्वेच्छा से कर रहा/रही हूँ। साथ ही, मैं अपनी स्पष्ट सहमति देता/देती हूँ कि मेरी आधार संख्या एवं आधार प्रमाणीकरण लेन-देन की प्रतिक्रिया को सुरक्षित रूप से संग्रहीत किया जाए।
hi: मैं (माता-पिता/कानूनी अभिभावक, यदि नाबालिग हो) स्वेच्छा से अपनी सहमति प्रदान करता/करती हूँ कि मेरे आधार संख्या का उपयोग DoIT&C चेहरा प्रमाणीकरण मोबाइल ऐप पर लॉगिन/पंजीकरण हेतु, भारतीय विशिष्ट पहचान प्राधिकरण (UIDAI) के माध्यम से आधार आधारित चेहरे के प्रमाणीकरण के लिए किया जाए। प्रमाणीकरण की प्रक्रिया में प्राप्त "हाँ/ना" उत्तर के आधार पर, मैं स्वयं को DoIT&C चेहरा प्रमाणीकरण मोबाइल ऐप पर पंजीकृत करने हेतु सहमति प्रदान करता/करती हूँ, जिससे ऐप की सेवाओं का उपयोग किया जा सके। मैं आधार आधारित चेहरे के प्रमाणीकरण का चयन स्वेच्छा से कर रहा/रही हूँ। साथ ही, मैं अपनी स्पष्ट सहमति देता/देती हूँ कि मेरी आधार संख्या एवं आधार प्रमाणीकरण लेन-देन की प्रतिक्रिया को सुरक्षित रूप से संग्रहीत किया जाए।

# requestConsentHi
source: मैं (माता-पिता/कानूनी अभिभावक, यदि नाबालिग हो) स्वेच्छा से अपनी सहमति प्रदान करता/करती हूँ कि मेरी आधार संख्या का उपयोग DoIT&C फेस ऑथेंटिकेशन मोबाइल ऐप पर भारतीय विशिष्ट पहचान प्राधिकरण (UIDAI) के माध्यम से <Purpose> हेतु आधार आधारित चेहरे के प्रमाणीकरण के लिए किया जाए, ताकि मैं <Department> की सेवाओं का लाभ प्राप्त कर सकूँ। विभाग द्वारा मुझे सूचित किया गया है कि मेरी आधार जानकारी का उपयोग उपर्युक्त उद्देश्य के अतिरिक्त किसी अन्य कार्य हेतु नहीं किया जाएगा। मैंने स्वेच्छा से आधार आधारित चेहरे के प्रमाणीकरण का चयन किया है। इसके अतिरिक्त, मैं अपनी स्पष्ट सहमति प्रदान करता/करती हूँ कि मेरी आधार संख्या एवं प्रमाणीकरण लेन-देन की प्रतिक्रिया को सुरक्षित रूप से संग्रहीत किया जाए।
hi: मैं (माता-पिता/कानूनी अभिभावक, यदि नाबालिग हो) स्वेच्छा से अपनी सहमति प्रदान करता/करती हूँ कि मेरी आधार संख्या का उपयोग DoIT&C चेहरा प्रमाणीकरण मोबाइल ऐप पर भारतीय विशिष्ट पहचान प्राधिकरण (UIDAI) के माध्यम से <Purpose> हेतु आधार आधारित चेहरे के प्रमाणीकरण के लिए किया जाए, ताकि मैं <Department> की सेवाओं का लाभ प्राप्त कर सकूँ। विभाग द्वारा मुझे सूचित किया गया है कि मेरी आधार जानकारी का उपयोग उपर्युक्त उद्देश्य के अतिरिक्त किसी अन्य कार्य हेतु नहीं किया जाएगा। मैंने स्वेच्छा से आधार आधारित चेहरे के प्रमाणीकरण का चयन किया है। इसके अतिरिक्त, मैं अपनी स्पष्ट सहमति प्रदान करता/करती हूँ कि मेरी आधार संख्या एवं प्रमाणीकरण लेन-देन की प्रतिक्रिया को सुरक्षित रूप से संग्रहीत किया जाए।

# dashboardConsent
source: Aadhaar face authentication is based on 1:1 (exact) matching. This means that the face image captured during authentication is matched with the face image stored in the Aadhaar repository against your Aadhaar number, which was taken at the time of enrolment.
hi: आधार चेहरा प्रमाणीकरण 1:1 (हूबहू) मिलान पर आधारित है जिसका अर्थ है कि प्रमाणीकरण के दौरान खींची गई चेहरे की छवि आपके चेहरे की छवि से मेल खाती है जो आपके आधार नंबर के साथ रिपॉजिटरी में संग्रहीत है, जिसे नामांकन के समय लिया गया था।

# appVersionTitle
source: New Version Available
hi: नया वर्जन उपलब्ध

# threatTitle
source: Security Threat
hi: सुरक्षा चेतावनी

# appVersionMsg
source: Please download the new version of the application
hi: कृपया एप का नया वर्जन डाउनलोड करे

# notRegisterTitle
source: Welcome User
hi: स्वागतम्

# notRegisterMsg
source: New Registration You are not registered. Please proceed for registration in this app.
hi: नया पंजीकरण आप पंजीकृत नहीं है| कृपया पंजीकरण करे|

source: Registration
hi: पंजीकरण

# afa
source: Aadhaar Face Authentication
hi: आधार चेहरा प्रमाणीकरण

# detail
source: Details
hi: विवरण

source: Register
hi: पंजीकरण

source: Update
hi: अपडेट

source: Exit
hi: बाहर जाए

source: Reports
hi: रिपोर्ट्स

source: Logout
hi: लॉग-आउट

source: Login
hi: लॉग-इन

source: Cancel
hi: रद्द करे

source: No, Cancel
hi: नहीं, रद्द करे

source: Yes, Confirm
hi: हाँ, पुष्टि करें

source: Ok
hi: ओके

# pendingReq
source: Pending Request
hi: लंबित अनुरोध

# makeSureLogout
source: Are you sure you want to logout?
hi: क्या आप लॉगआउट करना चाहते हैं?

# confirm
source: Yes, Confirm
hi: हाँ, पुष्टि करें

source: Register as Beneficiary
hi: लाभार्थी के रूप में पंजीकरण करें

source: Register as eMitra
hi: ई-मित्र के रूप में पंजीकरण करें

# aadhaarFieldValidation
source: Please update aadhaar number in SSO profile
hi: कृपया SSO प्रोफ़ाइल में आधार नंबर अपडेट करें

# nameFieldValidation
source: Please update Name SSO profile
hi: कृपया SSO प्रोफ़ाइल में नाम अपडेट करें

# mobileFieldValidation
source: Please update Mobile number in SSO profile
hi: कृपया SSO प्रोफ़ाइल में मोबाइल नंबर अपडेट करें

# consentFieldValidation
source: Please Check Aadhaar consent
hi: कृपया आधार सहमति स्वीकार करें

source: Kiosk Code
hi: कियोस्क कोड

source: SSO ID
hi: एस.एस.ओ. आईडी

source: Enter Kiosk Code
hi: कियोस्क कोड दर्ज करें

source: Enter SSO ID
hi: एस.एस.ओ. आईडी दर्ज करें

source: Name
hi: नाम

source: Enter Name
hi: नाम दर्ज करें

source: Mobile Number
hi: मोबाइल नंबर

# enterMobileNumber
source: Enter Mobile No.
hi: मोबाइल नंबर दर्ज करें

# refAadhaarNumber
source: Ref/Aadhaar No.
hi: रेफरेंस/आधार नंबर

# registrationSuccessful
source: Registration Success
hi: पंजीकरण सफल

# registrationSuccessMsg
source: Registration successful. Click OK to proceed to login.
hi: पंजीकरण सफल हुआ। लॉगिन करने के लिए OK दबाएँ।

source: FaceRD Not Found
hi: FaceRD इन्स्टॉल नहीं है

# rdAppMissingAlert
source: This service requires the FaceRD app. Do you want to install it from Play Store?
hi: इस सेवा के लिए FaceRD ऐप आवश्यक है। क्या आप इसे प्ले स्टोर से इंस्टॉल करना चाहते हैं?

source: User Login
hi: उपयोगकर्ता लॉगिन

# doITFaceAuthentication
source: DoIT&C Face Authentication
hi: DoIT&C चेहरा प्रमाणीकरण

# loginWithAadhaar
source: Login with Aadhaar No.
hi: आधार नंबर से लॉगिन करें

# loginWithSso
source: Login with SSO ID
hi: एस.एस.ओ. आईडी से लॉगिन करें

# loginSuccessfully
source: Logged in successfully
hi: सफलतापूर्वक लॉगिन

source: Enter Aadhaar No.
hi: आधार नंबर दर्ज करें

# aadhaarConsentAlert
source: Please check the Aadhaar consent checkbox to continue.
hi: जारी रखने के लिए कृपया आधार सहमति चेकबॉक्स चुनें।

# aadhaarNumberAlert
source: Please enter a valid 12-digit Aadhaar number.
hi: कृपया वैध 12 अंकों का आधार नंबर दर्ज करें।

# tokenError
source: Invalid Token or Expired : Re Login
hi: अमान्य या समाप्त टोकन : पुनः लॉगिन करें

source: Verify
hi: सत्यापित करें

source: Aadhaar
hi: आधार

# aadhaarNo
source: Aadhaar Number
hi: आधार नंबर

source: Department Name
hi: विभाग का नाम

source: Purpose
hi: उद्देश्य

source: Request ID
hi: अनुरोध आईडी

source: Reference Id
hi: रेफरेंस आईडी

source: Request
hi: अनुरोध

source: Request Type
hi: अनुरोध प्रकार

source: Time Stamp
hi: तिथि/समय

# noInternet
source: No internet connection
hi: इंटरनेट कनेक्शन उपलब्ध नहीं है

source: Error Code
hi: त्रुटि कोड

source: No Face Auth Request Pending !!
hi: चेहरा प्रमाणीकरण कीं कोई लंबित अनुरोध नहीं !!

source: Date/Time
hi: तिथि/समय

source: Home
hi: होम

source: Update App
hi: ऐप अपडेट करें

source: Download Face RD
hi: FaceRD डाउनलोड करें

# biometricSettings
source: Biometric Lock Setting
hi: बायोमेट्रिक लॉक सेटिंग

source: Enable Biometric
hi: बायोमेट्रिक चालू करें

# unlockBiometric
source: Unlock with biometric
hi: बायोमेट्रिक से अनलॉक करें

# byEnable
source: When enabled, biometric app lock will be activated. You can turn this feature on or off anytime
hi: सक्षम करने पर, बायोमेट्रिक ऐप लॉक सक्रिय हो जाएगा। आप इस सुविधा को कभी भी चालू या बंद कर सकते हैं।

source: About Us
hi: हमारे बारे में

source: Rate Us
hi: हमें रेट करें

source: App Version
hi: ऐप संस्करण

# forgotPwd
source: Forgot Password?
hi: पासवर्ड भूल गए?

source: Password
hi: पासवर्ड

source: Keep me logged in
hi: मुझे लॉगिन रखें

# missingSsoId
source: Please Enter SSO ID
hi: कृपया SSO आईडी दर्ज करें

# missingPwd
source: Please Enter Password
hi: कृपया पासवर्ड दर्ज करें

# authSuccess
source: Aadhaar Face Authentication Successful
hi: आधार चेहरा प्रमाणीकरण सफल

source: FaceRD App
hi: FaceRD ऐप

# faceAuthRDDownload
source: Aadhaar Face RD service app not found so download app from store
hi: आधार फेस RD सेवा ऐप नहीं मिला, कृपया प्ले स्टोर से डाउनलोड करें

# faceAuthRDAlready
source: Aadhaar Face RD App already Installed
hi: आधार फेस RD ऐप पहले से इंस्टॉल है

source: FaceAuth Locked
hi: चेहरा प्रमाणीकरण बंद है

# biometricMsg
source: Enable biometric login for quicker and secure access using your fingerprint or face.
hi: तेज़ और सुरक्षित लॉगिन के लिए फिंगरप्रिंट या फेस का उपयोग करें।

# aadhaarBasedAuth
source: Aadhaar Based Face Authentication
hi: आधार आधारित चेहरा प्रमाणीकरण

# ratingMsg
source: we will work harder to make you more satisfied.
hi: हम आपको और संतुष्ट करने के लिए अधिक मेहनत करेंगे।

source: Rate on Google Play
hi: गूगल प्ले पर रेट करें

source: No, Thanks!
hi: नहीं, धन्यवाद!

source: Thanks!
hi: धन्यवाद!

source: No Data Found !!
hi: कोई डेटा नहीं मिला !!

# splashMsg
source: Department of Information Technology & Communication, Government of Rajasthan
hi: सूचना प्रौद्योगिकी एवं संचार विभाग, राजस्थान सरकार

source: Enter Captcha
hi: कैप्चा दर्ज करें

# plzEnterValidCaptcha
source: Please enter valid Captcha
hi: कृपया मान्य कैप्चा दर्ज करें

# networkIssue
source: Network Issue, Try again later
hi: नेटवर्क समस्या, बाद में पुनः प्रयास करें

source: Device not supported
hi: डिवाइस सपोर्टेड नहीं है

# deviceNotSupportedMsg
source: Your device does not support biometric authentication.
hi: आपका डिवाइस बायोमेट्रिक प्रमाणीकरण को सपोर्ट नहीं करता।

source: Authenticate to continue
hi: जारी रखने के लिए प्रमाणित करें

# authenticateFailed
source: Authentication failed
hi: प्रमाणीकरण विफल हुआ

# biometricErrorTag
source: Biometric error:
hi: बायोमेट्रिक त्रुटि:

# biometricSetupError
source: Biometrics aren"t set up
hi: बायोमेट्रिक सेटअप चालू नहीं है

# biometricSetupErrorMsg
source: To enable this feature, please set up Face or Fingerprint unlock in your device settings.
hi: इस सुविधा को सक्षम करने के लिए, कृपया डिवाइस सेटिंग्स में फेस या फिंगरप्रिंट सेट करें।

# aadhaarNoReport
source: Aadhaar No.
hi: आधार नंबर

# departmentNameReport
source: Department Name
hi: विभाग का नाम

# dateTimeReport
source: Date/Time
hi: तिथि/समय

# requestTypeReport
source: Request Type
hi: अनुरोध प्रकार

# playHint
source: How to Login?👇
hi: कैसे लॉगिन करें?👇

# changeLang
source: Change Language
hi: भाषा बदलें

source: Operator
hi: ऑपरेटर

source: Beneficiary
hi: लाभार्थी

# usbDebugEnabled
source: Detected unsafe environment due to: Device is in Usb Debugging mode.
hi: असुरक्षित माहौल पाया गया: डिवाइस USB डिबग मोड में है।

# unsafeEnvFound
source: Detected unsafe environment due to
hi: असुरक्षित माहौल पाया गया

# deviceFridaRoot
source: Device Found Frida/Rooted.
hi: डिवाइस में Frida/Root मिला।

# deviceRooted
source: Device found rooted.
hi: डिवाइस रूटेड पाया गया।

# deviceEmulator
source: Device is Emulator.
hi: डिवाइस एमुलेटर है।

# mockLocEnabled
source: Device enabled mock location.
hi: डिवाइस में मॉक लोकेशन चालू है।

source: Fake Location
hi: फर्जी लोकेशन

# downloadRdByLink
source: Download from play store use App Drawer link to help.
hi: प्ले स्टोर से डाउनलोड करें या ऐप ड्रावर लिंक का इस्तेमाल करें।

# locDisable
source: Location services are disabled.
hi: लोकेशन सर्विस बंद है।

# locPermissionDeny
source: Location permission denied.
hi: लोकेशन की परमिशन मना कर दी गई।

# locPermanentDeny
source: Location permission permanently denied.
hi: लोकेशन की परमिशन हमेशा के लिए मना कर दी गई।

# locFetchFailed
source: Location fetch failed:
hi: लोकेशन प्राप्त करने में विफल:

# checkTerms
source: I accept Aadhaar consent
hi: मैं आधार सहमति स्वीकार करता हूं

source: View Consent
hi: सहमति देखें

# doitGoR
source: © DoIT&C, Govt. of Rajasthan
hi: © DoIT&C, राजस्थान सरकार
